pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/TA1_356.0_inst7.xml
    <register id="TA1CCR3" width="16" offset="0x18" internal="0" description="Timer_A Capture/Compare  Register">
    </register>
    <register id="TA1CCR4" width="16" offset="0x1A" internal="0" description="Timer_A Capture/Compare  Register">
    </register>
    <register id="TA1CCR5" width="16" offset="0x1C" internal="0" description="Timer_A Capture/Compare  Register">
    </register>
    <register id="TA1CCR6" width="16" offset="0x1E" internal="0" description="Timer_A Capture/Compare  Register">
    </register>
    <register id="TA1EX0" width="16" offset="0x20" internal="0" description="TimerAx Expansion 0 Register">
        <bitfield id="TAIDEX" description="Input divider expansion" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="1" value="0x0" description="Divide by 1"/>
            <bitenum id="2" value="0x1" description="Divide by 2"/>
            <bitenum id="3" value="0x2" description="Divide by 3"/>
            <bitenum id="4" value="0x3" description="Divide by 4"/>
            <bitenum id="5" value="0x4" description="Divide by 5"/>
            <bitenum id="6" value="0x5" description="Divide by 6"/>
            <bitenum id="7" value="0x6" description="Divide by 7"/>
            <bitenum id="8" value="0x7" description="Divide by 8"/>
        </bitfield>
    </register>
    <register id="TA1IV" width="16" offset="0x2E" internal="0" description="TimerAx Interrupt Vector Register">
        <bitfield id="TAIV" description="TimerA interrupt vector value" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="TACCR1" value="0x2" description="Interrupt Source: Capture/compare 1; Interrupt Flag: TAxCCR1 CCIFG; Interrupt Priority: Highest"/>
            <bitenum id="TACCR2" value="0x4" description="Interrupt Source: Capture/compare 2; Interrupt Flag: TAxCCR2 CCIFG"/>
            <bitenum id="TACCR3" value="0x6" description="Interrupt Source: Capture/compare 3; Interrupt Flag: TAxCCR3 CCIFG"/>
            <bitenum id="TACCR4" value="0x8" description="Interrupt Source: Capture/compare 4; Interrupt Flag: TAxCCR4 CCIFG"/>
            <bitenum id="TACCR5" value="0xA" description="Interrupt Source: Capture/compare 5; Interrupt Flag: TAxCCR5 CCIFG"/>
            <bitenum id="TACCR6" value="0xC" description="Interrupt Source: Capture/compare 6; Interrupt Flag: TAxCCR6 CCIFG"/>
            <bitenum id="TAIFG" value="0xE" description="Interrupt Source: Timer overflow; Interrupt Flag: TAxCTL TAIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
</module>
